export default {
  START: '0',
  SINGLE_CROWD: '10',
  BATCH_CROWD: '11',
  RULE_CROWD: '12',
  MERGE: '20',
  SPLIT: '21',
  AND: '22',
  EXCLUDE: '23',
  UNIQUE: '24',
  GOAL_CROWD: '30',
  DONGDONG: '40',
  SMS: '41',
  END: '100',
};
    // /**
    //  * 流程开始节点，开始节点分组0仅限连接分组10和分组30
    //  */
    // START(0, "开始", 0, "开始"),
    // /**
    //  * 单个人群包
    //  */
    // SINGLE_CROWD(10, "单个人群包", 10, "营销对象"),
    // /**
    //  * 批量人群包
    //  */
    // BATCH_CROWD(11, "批量人群包", 10, "营销对象"),
    // /**
    //  * 人群规则
    //  */
    // RULE_CROWD(12, "人群规则", 10, "营销对象"),

    // /**
    //  * 人群计算-合并
    //  */
    // MERGE(20, "合并", 20, "人群计算"),
    // /**
    //  * 人群计算-拆分
    //  */
    // SPLIT(21, "拆分", 20, "人群计算"),
    // /**
    //  * 人群计算-交集
    //  */
    // AND(22, "交集", 20, "人群计算"),
    // /**
    //  * 人群计算-排除
    //  */
    // EXCLUDE(23, "排除", 20, "人群计算"),

    // /**
    //  * 目标人群，对接真实要发送的人群包
    //  */
    // GOAL_CROWD(30, "目标人群", 30, "目标人群"),

    // /**
    //  * 对象触达-咚咚
    //  */
    // DONGDONG(40, "咚咚", 40, "对象触达"),
    // /**
    //  * 对象触达-短信
    //  */
    // SMS(41, "短信", 40, "对象触达"),

    // /**
    //  * 结束
    //  */
    // END(100, "结束", 100, "结束"),

// 可编辑画布状态
export const canEdit = ['0', '2'];
// 不可编辑画布状态
export const canNotEdit = ['1', '3', '4', '5', '6'];
export const canvasStatusObj = {
  0: '草稿',
  1: '模拟执行中',
  2: '模拟执行完成',
  3: '任务数据处理中',
  4: '任务创建中',
  5: '任务创建成功',
  6: '任务创建失败',
};

/**
     * 画布可编辑状态
     */
// DRAFT(0, "草稿"),
// /**
//  * 画布模拟是否可以创建任务，此状态不可在进行画布编辑和保存
//  */
// SIMULATE_EXECUTING(1, "模拟执行中"),
// /**
//  * 画布模拟结束，此状态可再次进行画布编辑和保存
//  */
// SIMULATE_EXECUTED(2, "模拟执行完成"),
// /**
//  * 画布保存成功后状态，数据处理中，进行目标人群生成处理
//  * 不可编辑画布
//  */
// DATA_HANDLING(3, "任务数据处理中"),
// /**
//  * 创建任务组
//  *不可编辑画布
//  */
// TASK_CREATING(4, "任务创建中"),
// /**
//  * 任务创建成功，不可编辑画布
//  */
// TASK_CREATED(5, "任务创建成功"),
// /**
//  * 任务创建失败，不可编辑画布
//  */
// TASK_FAILED(6, "任务创建失败"),
